[
  {
    "gross":"$310,675,583",
    "year":"2002",
    "castList":[
      "Ewan McGregor",
      "Natalie Portman",
      "Hayden Christensen",
      "Christopher Lee",
      "Samuel L. Jackson",
      "Frank Oz",
      "Ian McDiarmid",
      "Pernilla August",
      "Temuera Morrison",
      "Jimmy Smits",
      "Jack Thompson",
      "Leeanna Walsman",
      "Ahmed Best",
      "Rose Byrne",
      "Oliver Ford Davies"
    ],
    "genreList":[
      "Action",
      "Adventure",
      "Fantasy",
      "Sci-Fi"
    ],
    "description":"Ten years after the invasion of Naboo, the Galactic Republic is facing a Separatist movement and the former queen and now Senator Padmé Amidala travels to Coruscant to vote on a project to create an army to help the Jedi to protect the Republic. Upon arrival, she escapes from an attempt to kill her, and Obi-Wan Kenobi and his Padawan Anakin Skywalker are assigned to protect her. They chase the shape-shifter Zam Wessell but she is killed by a poisoned dart before revealing who hired her. The Jedi Council assigns Obi-Wan Kenobi to discover who has tried to kill Amidala and Anakin to protect her in Naboo. Obi-Wan discovers that the dart is from the planet Kamino, and he heads to the remote planet. He finds an army of clones that has been under production for years for the Republic and that the bounty hunter Jango Fett was the matrix for the clones. Meanwhile Anakin and Amidala fall in love with each other, and he has nightmarish visions of his mother. They travel to his home planet, ...",
    "directorList":[
      "George Lucas"
    ],
    "characterList":[
      "Obi-Wan Kenobi",
      "Padmé",
      "Anakin Skywalker",
      "Count Dooku",
      "Darth Tyranus",
      "Mace Windu",
      "Yoda",
      "Supreme Chancellor Palpatine",
      "Shmi Skywalker",
      "Jango Fett",
      "Senator Bail Organa",
      "Cliegg Lars",
      "Zam Wesell",
      "Jar Jar Binks",
      "Achk Med-Beq",
      "Dormé",
      "Sio Bibble"
    ],
    "title":"Star Wars II: Attack of the Clones",
    "ratingCount":"473,080",
    "countryList":[
      "USA"
    ],
    "url":"http://akas.imdb.com/title/tt0121765/?ref_=fn_ft_tt_1",
    "duration":"2h 22min",
    "ratingValue":"6.7",
    "budget":"$115,000,000"
  }
]
