[
  {
    "gross":"$110,416,702",
    "year":"2008",
    "castList":[
      "Jeff Kahn",
      "Robert Downey Jr.",
      "Anthony Ruivivar",
      "Jack Black",
      "Jay Baruchel",
      "Brandon T. Jackson",
      "Ben Stiller",
      "Eric Winzenried",
      "Steve Coogan",
      "Valerie Azlynn",
      "Matt Levin",
      "David Pressman",
      "Amy Stiller",
      "Danny McBride",
      "Dempsey Silva"
    ],
    "genreList":[
      "Action",
      "Comedy"
    ],
    "description":"Action movie star Tugg Speedman is on the downslide of his professional career. He wants to be considered a serious actor, but his latest serious role as the title character in \"Simple Jack\" resulted in negative reviews and ridicule. Comedian Jeff Portnoy is best known for his leading roles in sophomoric comedies, and may be less well known for his rampant drug use. Five time Oscar winner Kirk Lazarus is a serious method actor, who immerses himself in whatever the role. On location in southeast Vietnam, they are the stars of \"Tropic Thunder\", based on Vietnam war veteran 'Four Leaf' Tayback's memoirs of his rescue during the war, that rescue which was considered a near suicide mission for the assigned army force and resulted in him losing both hands. For his role, Caucasian Australian Lazarus even went through a controversial surgical skin dying procedure so that he could convincingly play a black man. Production is not going well since rookie director Damien Cockburn is unable to ...",
    "directorList":[
      "Ben Stiller"
    ],
    "characterList":[
      "Snooty Waiter - Fatties Trailer",
      "Kirk Lazarus",
      "Platoon Sergeant Shot in Head - Hot LZ",
      "Jeff Portnoy - Hot LZ",
      "Kevin Sandusky - Hot LZ",
      "Alpa Chino - Hot LZ",
      "Tugg Speedman - Hot LZ",
      "Chopper Pilot - Hot LZ",
      "Damien Cockburn - Vietnam Crew",
      "Damien's Assistant - Vietnam Crew",
      "Cody - Vietnam Crew"
    ],
    "title":"Tropic Thunder",
    "ratingCount":"311,621",
    "countryList":[
      "USA",
      "UK",
      "Germany"
    ],
    "url":"http://akas.imdb.com/title/tt0942385/?ref_=fn_ft_tt_1",
    "duration":"1h 47min",
    "ratingValue":"7.0",
    "budget":"$92,000,000"
  }
]
